from fastapi import FastAPI
from typing import Optional
import requests, time

app = FastAPI()

@app.get("/subway/seoul")
def seoul(lineId: Optional[str] = None):
    lineNames = {
        '1': '1호선',
        '2': '2호선'
    }
    
    if lineNames.get(lineId): return topis(lineNames[lineId], lineId)

    return []

def topis(lineName, lineId): # https://data.seoul.go.kr/dataList/OA-12601/A/1/datasetView.do
    key = '안알랴줌'
    url = 'http://swopenapi.seoul.go.kr/api/subway/' + key + '/json/realtimePosition/0/141/' + lineName
    response = requests.get(url)
    json = response.json()['realtimePositionList']
    # return json

    statuses = ['접근', '도착', '출발', '접근'] # 진입, 도착, 출발, 전역출발
    types = ['일반', '급행', None, None, None, None, None, '특급']
    data = []
    for datum in json:
        if lineId == '2': datum = line2_fix(datum)
        data.append({
            'stnId': datum['statnId'],
            'updn': 'up' if datum['updnLine'] == '0' else 'dn',
            'dest': datum['statnTnm'],
            'status': statuses[int(datum['trainSttus'])],
            'type': types[int(datum['directAt'])],
            'no': datum['trainNo']
        })
    # return data

    stns = get_stn_list(lineId)
    result = []
    for stn in stns:
        datum = {
            'stn': stn['stn'],
            'up': [],
            'dn': []
        }
        for train in data:
            if train['stnId'] == stn['id']: 
                datum[train['updn']].append({
                    'status': train['status'],
                    'type': train['type'],
                    'dest': train['dest'],
                    'no': train['no']
                })
        result.append(datum)

    return result

def get_stn_list(lineId):
    if lineId == '1':
        return [{'stn':'소요산','id':'1001000100'},{'stn':'동두천','id':'1001000101'},{'stn':'보산','id':'1001000102'},{'stn':'동두천중앙','id':'1001000103'},{'stn':'지행','id':'1001000104'},{'stn':'덕정','id':'1001000105'},{'stn':'덕계','id':'1001000106'},{'stn':'양주','id':'1001000107'},{'stn':'녹양','id':'1001000108'},{'stn':'가능','id':'1001000109'},{'stn':'의정부','id':'1001000110'},{'stn':'회룡','id':'1001000111'},{'stn':'망월사','id':'1001000112'},{'stn':'도봉산','id':'1001000113'},{'stn':'도봉','id':'1001000114'},{'stn':'방학','id':'1001000115'},{'stn':'창동','id':'1001000116'},{'stn':'녹천','id':'1001000117'},{'stn':'월계','id':'1001000118'},{'stn':'광운대','id':'1001000119'},{'stn':'석계','id':'1001000120'},{'stn':'신이문','id':'1001000121'},{'stn':'외대앞','id':'1001000122'},{'stn':'회기','id':'1001000123'},{'stn':'청량리','id':'1001000124'},{'stn':'제기동','id':'1001000125'},{'stn':'신설동','id':'1001000126'},{'stn':'동묘앞','id':'1001000127'},{'stn':'동대문','id':'1001000128'},{'stn':'종로5가','id':'1001000129'},{'stn':'종로3가','id':'1001000130'},{'stn':'종각','id':'1001000131'},{'stn':'시청','id':'1001000132'},{'stn':'서울','id':'1001000133'},{'stn':'남영','id':'1001000134'},{'stn':'용산','id':'1001000135'},{'stn':'노량진','id':'1001000136'},{'stn':'대방','id':'1001000137'},{'stn':'신길','id':'1001000138'},{'stn':'영등포','id':'1001000139'},{'stn':'신도림','id':'1001000140'},{'stn':'구로','id':'1001000141'},{'stn':'가산디지털단지','id':'1001080142'},{'stn':'독산','id':'1001080143'},{'stn':'금천구청','id':'1001080144'},{'stn':'석수','id':'1001080145'},{'stn':'관악','id':'1001080146'},{'stn':'안양','id':'1001080147'},{'stn':'명학','id':'1001080148'},{'stn':'금정','id':'1001080149'},{'stn':'군포','id':'1001080150'},{'stn':'당정','id':'1001080151'},{'stn':'의왕','id':'1001080152'},{'stn':'성균관대','id':'1001080153'},{'stn':'화서','id':'1001080154'},{'stn':'수원','id':'1001080155'},{'stn':'세류','id':'1001080156'},{'stn':'병점','id':'1001080157'},{'stn':'세마','id':'1001080158'},{'stn':'오산대','id':'1001080159'},{'stn':'오산','id':'1001080160'},{'stn':'진위','id':'1001080161'},{'stn':'송탄','id':'1001080162'},{'stn':'서정리','id':'1001080163'},{'stn':'평택지제','id':'1001080164'},{'stn':'평택','id':'1001080165'},{'stn':'성환','id':'1001080166'},{'stn':'직산','id':'1001080167'},{'stn':'두정','id':'1001080168'},{'stn':'천안','id':'1001080169'},{'stn':'봉명','id':'1001080170'},{'stn':'쌍용','id':'1001080171'},{'stn':'아산','id':'1001080172'},{'stn':'탕정','id':'1001080173'},{'stn':'배방','id':'1001080174'},{'stn':'온양온천','id':'1001080175'},{'stn':'신창','id':'1001080176'},
                {'stn':'구일','id':'1001000142'},{'stn':'개봉','id':'1001000143'},{'stn':'오류동','id':'1001000144'},{'stn':'온수','id':'1001000145'},{'stn':'역곡','id':'1001000146'},{'stn':'소사','id':'1001000147'},{'stn':'부천','id':'1001000148'},{'stn':'중동','id':'1001000149'},{'stn':'송내','id':'1001000150'},{'stn':'부개','id':'1001000151'},{'stn':'부평','id':'1001000152'},{'stn':'백운','id':'1001000153'},{'stn':'동암','id':'1001000154'},{'stn':'간석','id':'1001000155'},{'stn':'주안','id':'1001000156'},{'stn':'도화','id':'1001000157'},{'stn':'제물포','id':'1001000158'},{'stn':'도원','id':'1001000159'},{'stn':'동인천','id':'1001000160'},{'stn':'인천','id':'1001000161'},{'stn':'광명','id':'1001080141'},{'stn':'서동탄','id':'1001801571'}]
    if lineId == '2':
        return [{'stn':'성수','id':'1002000211'},{'stn':'건대입구','id':'1002000212'},{'stn':'구의','id':'1002000213'},{'stn':'강변','id':'1002000214'},{'stn':'잠실나루','id':'1002000215'},{'stn':'잠실','id':'1002000216'},{'stn':'잠실새내','id':'1002000217'},{'stn':'종합운동장','id':'1002000218'},{'stn':'삼성','id':'1002000219'},{'stn':'선릉','id':'1002000220'},{'stn':'역삼','id':'1002000221'},{'stn':'강남','id':'1002000222'},{'stn':'교대','id':'1002000223'},{'stn':'서초','id':'1002000224'},{'stn':'방배','id':'1002000225'},{'stn':'사당','id':'1002000226'},{'stn':'낙성대','id':'1002000227'},{'stn':'서울대입구','id':'1002000228'},{'stn':'봉천','id':'1002000229'},{'stn':'신림','id':'1002000230'},{'stn':'신대방','id':'1002000231'},{'stn':'구로디지털단지','id':'1002000232'},{'stn':'대림','id':'1002000233'},{'stn':'신도림','id':'1002000234'},{'stn':'문래','id':'1002000235'},{'stn':'영등포구청','id':'1002000236'},{'stn':'당산','id':'1002000237'},{'stn':'합정','id':'1002000238'},{'stn':'홍대입구','id':'1002000239'},{'stn':'신촌','id':'1002000240'},{'stn':'이대','id':'1002000241'},{'stn':'아현','id':'1002000242'},{'stn':'충정로','id':'1002000243'},{'stn':'시청','id':'1002000201'},{'stn':'을지로입구','id':'1002000202'},{'stn':'을지로3가','id':'1002000203'},{'stn':'을지로4가','id':'1002000204'},{'stn':'동대문역사문화공원','id':'1002000205'},{'stn':'신당','id':'1002000206'},{'stn':'상왕십리','id':'1002000207'},{'stn':'왕십리','id':'1002000208'},{'stn':'한양대','id':'1002000209'},{'stn':'뚝섬','id':'1002000210'},
                {'stn':'성수 (지선)','id':'1002000211'},{'stn':'용답','id':'1002002111'},{'stn':'신답','id':'1002002112'},{'stn':'용두','id':'1002002113'},{'stn':'신설동','id':'1002002114'},
                {'stn':'신도림 (지선)','id':'1002000234'},{'stn':'도림천','id':'1002002341'},{'stn':'양천구청','id':'1002002342'},{'stn':'신정네거리','id':'1002002343'},{'stn':'까치산','id':'1002002344'}] #,{'stn':'성수종착','id':'1002000211'}

    return []

def line2_fix(datum):
    # 열차번호 시작 숫자 : 행선지
    # 1 성수지선 열차
    # 2 본선 순환
    # 3 본선 (성수발 아님)
    # 4 본선 신도림행
    # 5 신정지선 열차
    # 6 본선 성수행
    # 7 순환 아님, 성수 종착 아님
    # 8 순환 아님, 성수 종착 아님
    # 9 지선 임시열차
    no = datum['trainNo'][0]
    if no == '1': datum['statnTnm'] = '성수 (지선)'
    elif no == '4': datum['statnTnm'] = '신도림'
    elif no == '5': datum['statnTnm'] = '신도림 (지선)'
    elif no == '6': datum['statnTnm'] = '성수'
    else:
        if datum['updnLine'] == '0': datum['statnTnm'] = '내선순환'
        else: datum['statnTnm'] = '외선순환'

    return datum
